Revit 2027 API
ParameterTypeId.FamProfileUsage Property
 "Profile Usage"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamProfileUsage { get; }
Public Shared ReadOnly Property FamProfileUsage As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamProfileUsage {
	ForgeTypeId^ get ();
}
static member FamProfileUsage : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace